#  🙋 영역 1



## 🔎 Amazon Cloud Front 주요 기능

- 최종 사용자에게 **더 짧은 지연 시간**으로 콘텐츠를 전송하기 위해 사용함



## 🔎 High Level Architecture

- ### 안정성

  - #### 기본 요건 

    - IAM을 통하여 서비스 및 리소스에 대한 접근을 제어
    - VPC을 통해서 서비스 및 리소스들을 독립된 네트워크 공간에 안전하게 운영
    - Service Limit 관리

  - #### 변경 관리

    - CloudTrail 을 통해여 API 호출에 대한 기록을 보관
    - Config를 통하여 자원 및 구성에 대한 인벤토리를 관리
    - 지속적으로 구성 변경을 관리

  - #### 장애 관리

    - **CloudFormation**을 사용하여 원하는 리소스들을 자동 생성하는 템플릿 구성 (openstack의 HOT template)
    - Auto Scaling Group을 활용하여 Self Healing 설정

- ### 성능

  - #### **Compute**

    - Auto Scaling 등의 방법을 사용하여 수요에 맞는 인스턴스 갯수를 유지하도록 관리

  - #### **Storage**

    - EBS
    - S3
    - Serverless

  - #### **Database**

    - RDS, DynamoDB, Redshift, ElastiCache
    - RDS는 다양한 기능(PIOPS, Read Replica)을 제공하여 성능을 최적화

  - #### **용량-시간의 트레이드 오프**

    - Region, CloudFront 등을 활용
    - 제약이 없는 많은 용량을 사용하여 프로세싱 시간을 절약

- ### 비용

  - #### 필요한 만큼만 사용

    - AutoScaling을 이용하여 필요한 만큼의 자원만 사용

  - #### 비용 효율적인 자원 사용

    - Spot 인스턴스를 통하여 비용을 절감
    - Trusted Advisor를 사용하여 AWS 환경에 대한 검토를 수행하고 비용 절감 가능성을 탐색

  - #### 비용 인지

    - CloudWatch 알람 및 SNS를 활용하여 비용 관리 프로세스 수립

  - #### 지속적인 최적화

    - Trusted Advisor를 통하여 비용 절감 요소를 탐색

- ### 보안

  - #### 데이터 보호 

    - 전송 및 보관시 암호화 : ELB, EBS, S3 , RDS
    - 암호화 키 생성 및 관리 : KMS, CloudHSM

  - #### 권한 관리

    - 사용자/권한 관리 : IAM
    - 인증 강화 : MFA

  - #### 인프라 보호

    - 논리적으로 격리된 네트워크 : VPC

  - #### 감시 제어

    - API 호출 기록 (사용자의 기록) : Cloud Trail

    - 인벤토리 변경 이력 관리 : AWS Config

    - 자원 모니터링 : CloudWatch

    - 로그 수집 : CloudFront, VPC FlowLogs, ELB, S3

      

## 🔎 느슨한 결합을 구현하기 위한 서비스들



- ### ELB

  - #### Application

    - 애플리케이션 요구사항에 따라 적절한 로드 밸런서를 선택 (HTTP 요청을 로드밸런싱)

  - #### Network

    - 네트워크/전송 프로토콜 로드 밸런싱의 경우와 **고도의 성능이 요구되거나 지연시간이 낮아**야 하는 애플리케이션의 경우
    - 초당 수백만 개의 요청과 갑작스럽고 변동이 높은 트래픽 패턴을 처리하도록 설계됨

  - #### Classic

    - 애플리케이션이  EC2  Classic 네트워크에서 구축된 경우

  - #### Gateway

- ### AutoScaling

  - Cloudwatch에서 AutoScaling을 활성화함

  - AutoScaling에서 애플리케이션 스택을 선택하려면 CloudFormation 스택을 선택하거나  공통 리소스를 선택하면 됨

  - #### 규모 조정 가능한 리소스

    - EC2 Auto Scaling group
    - Elastic Contianer Service : 완전 관리형 컨테이너 오케이스트레이션 서비스 (Openstack의 HEAT)
    - EC2 Spot Fleet : 미사용 EC2 용량을 활용
    - DynamoDB 처리 용량
    - Aurora 복제본

  - #### 예약된 조정

    - 자체 조정 일정을 설정 가능
    - Ex.  매주 수요일에 웹 애플리케이션에 대한 트래픽이 증가하고 목요일까지 높은 상태로 유지되다가 금요일에 줄어든다.  (패턴이 존재함)

  - #### 동적인 조정

    - 수요 변화에 대응하여 용량을 조정하는 방법
    - EC2 Auto Scaling에게 특정 Cloudwatch 지표를 추적하도록 지시 > 연결된 Cloudwatch 경보가 ALARM 상태에 있을 때 수행할 작업을 정의  > 경보를 트리거함
    - 조정 정책 유형
      - **대상 추적 조정** : **특정한 지표의 목표 값**을 기준으로 그룹의 현재 용량을 늘리거나 줄인다. 
      - **단계 조정** : 그룹의 현재 용량을 일렬한 조정 조절에 따라 늘리거나 줄이며 경보 위반의 크기에 따라 달라진다
      - 단순 조정

- ### SQS

  - 분산 애플리케이션에서 **"Polling"** 모델을 통해 메시지를 교환하는데 사용되는 메시지 대기열 서비스
  - 송신 구성 요소와 수신 구성 요소를 분리 가능
  - EC2, ECS, Lambda와 같은 컴퓨팅 서비스 뿐만 아니라 S3, DynamoEB 등과 같은 스토리지 및 데이터베이스 서비스와 함께 사용하여 애플리케이션의 유연성과 확장성을 높을 수 있음
  - **제한 시간 초과** : SQS가 메시지를 소비하는 다른 구성요소 에서 메시지를 수신 및 처리하지 못하도록 하는 기간
  - **긴 폴링** : 대기열에서 메시지를 검색하는 방법으로, 메시지가 메시지 대기열에 도달하거나 긴 폴링 제한 시간이 초과할 때까지 응답을 반환하지 않는다
    - 긴 폴링을 사용하면 빈 응답을 수신하는 횟수를 줄일 수 있으므로 SQS 사용 비용을 절감 가능
  - 짧은 폴링 : 폴링되는 메시지 대기열이 비어 있는 경우에도 즉각 응답을 반환함
  - 메시지 보존 기간은 1분 ~14일

- ### SNS

  - 클라이언트에게 전송되는 알람이 **"PUSH"** 메커니즘을 사용 >> **다수의 구독자**에게 시간이 관건인 메시지를 보낼 수 있음

  - 주제당 구독 1,000만건 및 계정 당 10만건을 제공 / 더 높은 할당량을 위해서는 Suppot에 문의

  - 모바일 푸시, HTTP 엔트포인트, SQS, 이메일 및 SMS 등과  같이 SNS 대상에 알림을 전송 + Lambda 함수 호출

  - SNS 주제에 Lambda 함수를 구독함으로써, 사용자 지정 메시지 처리를 수행 가능

    

## 🔎 안정적이고 복원력을 갖춘 스토리지 선택하기



#### 📑 EC2 스토리지

#### 		📑 EC2 인스턴스 스토어

   - 인스턴스에 블록 수준의 임시 스토리지를 제공
   - 호스트 컴퓨터에 물리적으로 연결된 디스크에 위치함
   - 자주 변경되는 정보의 임시 스토리지나 로드가 분산된 웹 서버 풀과 같은 여러 인스턴스 상에서 복제되는 데이터가 적합
   - 인스턴스의 수명 기간 동안에만 지속됨
   - 인스턴스 스토어의 데이터가 손실되는 경우
        - 기본  디스크 드라이브 오류
        - 인스턴스 종료 / 중지
        - 인스턴스가 최대 절전 모드로 전환
- 중요한 장기 데이터는 S3나 EBS, EFS에 보관해야함

#### 		📑 EBS

- 인스턴스 스토어와 다르게 EBS 볼륨에 저장된 데이터는 인스턴스 수명과 별도로 지속 가능 ("Delete on termination" 플래그를 No로 설정하면 됨)
- 단일 EC2 인스턴스에서 **가장 짧은 지연시간**으로 데이터에 액세스해야하는 워크로드에  필요한 성능 제공
- EBS  유형
  - 프로비저닝된 IOPS SSD :  99.999%의 100배 내구성을 제공하도록 설계
  - 범용 SSD : 대부분의 애플리케이션에 적합한 가격 및 성능 균형을 제공
    - SSD : 트랜잭션 워크로드를 위한 스토리지 (주로 IOPS, **지연 시간 및 내구성**이 성능을 좌우)
  - 처리량 최적화 HDD
  - 콜드 HDD
    - HDD : 처리량 워크로드를 위한 스토리지 (**처리량**이 성능을 좌우)

#### 		📑 EFS

- 파일 스토리지를 간편하게 설정하고 확장하고 비용을 최적화할 수 있도록 지원하는 완전 관리형 서비스
- 빅데이터 분석, 미디어 처리 워크플로, 콘텐츠 관리, 웹 지원 및 홈 디렉토리를 비롯하여 **다양한 워크로드와 애플리케이션에 필요한 성능**을 제공하도록 설계
- 수천 개의 EC2 인스턴스를 위한 파일 시스템 인터페이스, 액세스 시맨틱 및 동시에 액세스 가능한 스토리지를 제공
- **Linux 기반** 인스턴스에 파일 시스템을 탑재
- **DataSync vs Direct Connect** : 데이터를 파일 시스템으로 로드하는 방법
  - DataSync : 온프레미스 스토리지와 EFS 서비스 간에 데이터를 빠르고 쉽게 이동할 수 있도록 해주는 온라인 데이터 전송 서비스
  - Direct Connect :  대역폭이 높고 지연 시간이 짧은 전용 네트워크 연결을 제공 (온프레미스 -> EFS)
- Multi - AZ 제공

#### 		📑 S3

- 어디에서나 액세스할 수 있는 인터넷 API를 통해 데이터를 사용

- S3 Transfer Accelation :  거리가 먼 클라이언트와 버킷 간에 파일을 **빠르고, 쉽고, 안전하게 전송**할 수 있게 해준다 / Cloudfront의 edge location을 활용

- 참고 사이트 : 

  https://blog.naver.com/PostView.nhn?blogId=sha0820&logNo=222213058576&parentCategoryNo=6&categoryNo=&viewDate=&isShowPopularPosts=false&from=postList

#### 📑 Glacier 

- 데이터 백업 및 아카이브를 위한 안전하고 안정적이며 유연한 스토리지를 제공하는 매우 저렴한 스토리지 서비스
- 표준 검색은 보통 3~5 시간 내에 완료
- 대량 검색은 5~**12 시간**
- 긴급 검색은 1~5분 이내

#### 📑 Storage Gateway

- 클라우드 스토리지에 대한 온프레미스 액세스 권한을 제공하는 하이브리드 클라우드 스토리지 서비스
- 클라우드 스토리지 서비스에 데이터를 안전하고 안정적으로 저장하면서 자주 액세스하는 데이터는 온프레미스에 캐싱하면 지연 시간이 짧은 성능을 제공한다. 
- Storage gateway는 S3 클라우드 스토리지와 기본적으로 통합하여 데이터를 클라우드에 처리 가능
- Storage gateway는 IAM와 통합하여 서비스 및 리소스에 대한 액세스 관리를 안전하게 보호 가능
- Storage gateway는 KMS와 통합하여 클라우드에 저장된 데이터를 암호화 가능
- Storage gateway는 Cloudwatch와 통합하여 모니터링 제공
- Storage gateway는 CloudTrail과 통합하여 계정 활동을 로깅 가능
- 이를 통해 S3 클라우드 스토리지를 활용하여 **온프레미스 스토리지 공간과 관련 비용을 줄일 수 있다**
- 사용 사례
  - 백업 및 아카이브를 클라우드로 이동
  - 클라우드 기반 파일 공유를 통한 온프레미스 스토리지 감소
  - 온프레미스 애플리케이션에 AWS에 저장된 데이터에 대한 짧은 지연 시간의 액세스 제공

